Repository: MacPass/KeePassKit
Catalog: KeePassKit/Localization/*.lproj/Localizable.strings
Languages: de

source: Add Custom Icon
de: Icon hinzufügen

source: Alignment Error
de: Speicherausrichtungsfehler

source: Buffer Too Small
de: Puffer zu klein

source: Database
de: Datenbank

source: Decode Error
de: Dekodierungsfehler

source: Delete Custom Icon
de: Icon entfernen

# ERROR_AES_DECRYPTION_FAILED
source: AES decryption failed
de: AES Entschlüsselung fehlgeschlagen

# ERROR_AES_ENCRYPTION_FAILED
source: AES encryption failed
de: AES Verschlüsselung fehlgeschlagen

# ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED
source: The attribute key is not unique!
de: Bezeichnung wird bereits verwendet!

# ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED
source: The autotype sequence is not valid!
de: Die Autotype-Sequenz ist fehlerhaft!

# ERROR_CORRUPT_TREE
source: The internal file structure is corrupted!
de: Interne Datenstruktur defekt!

# ERROR_DECRYPTION_FAILED
source: Decryption failed
de: Entschlüsseln fehlgeschlagen

# ERROR_ENCRYPTION_FAILED
source: Encryption failed
de: Verschlüsseln fehlgeschlagen

# ERROR_GROUP_ELEMENT_MISSING
source: The XML file contains no group node
de: Datenbank-XML enthält kein Group-Element

# ERROR_HEADER_CORRUPTED
source: Header is corrupted
de: Header-Daten sind beschädigt

# ERROR_HEADER_HASH_MISSMATCH
source: The header hash doesn't match. File corrupted
de: Fehlerhafte Datei: Header-Hash stimmt nicht mit Daten überein.

# ERROR_HEADER_HASH_VERIFICATION_FAILED
source: The database header hash is wrong. Data integrity might be broken!
de: Datenbank-Hash falsch. Datenintegrität ist möglicherweise verletzt!

# ERROR_INTEGRITY_CHECK_FAILED
source: The database integrity isn't ensured
de: Die Integrität der Datei konnte nicht sichergestellt werden

# ERROR_INVALID_FIELD_SIZE
source: Incorrect size at data field. Password wrong?
de: Datenfeld mit falscher Größe. Passwort falsch?

# ERROR_INVALID_FIELD_TYPE
source: Unknown data field. Password wrong?
de: Unbekanntes Datenfeld. Passwort falsch?

# ERROR_INVALID_HEADER_FIELD_SIZE
source: Invalid header field size
de: Falsche Größe eines Header-Feldes

# ERROR_INVALID_HEADER_FIELD_TYPE
source: Invalid header field type
de: Falscher Typ eines Header-Feldes

# ERROR_INVALID_HEADER_IV_SIZE
source: Invalid header initalization vector size
de: Falsche Größe des Initalisierungs-Vektors im Header

# ERROR_KDB_CORRUPT_TREE
source: Corrupted KDB tree
de: Defekter KDB-Baum

# ERROR_KDB_FILE_HEADER_TRUNCATED
source: KDB header truncated
de: KDB-Header unvollständig

# ERROR_KDBX_CORRUPTED_CONTENT_STREAM
source: The content stream is corrupted
de: Die Inhaltsdaten sind fehlerhaft.

# ERROR_KDBX_CORRUPTED_ENCRYPTION_STREAM
source: The encrypted stream is corrupted
de: Die verschlüsselten Daten sind fehlerhaft.

# ERROR_KDBX_CORRUPTED_INNER_HEADER
source: The inner header data is corrupted
de: Der innere Header ist fehlerhaft.

# ERROR_KDBX_CORRUPTED_PUBLIC_CUSTOM_DATA
source: The public custom data is corrupted
de: Die unverschlüsselten öffentlichen Daten sind fehlerhaft.

# ERROR_KDBX_INVALID_INNER_HEADER_FIELD
source: The inner header contains an invalid field
de: Der innere Header enthält ein unbekanntes Feld

# ERROR_KDBX_INVALID_KEY_DERIVATION_DATA
source: The key derivation data is invalid
de: Die Daten zur Schlüsselherleitung sind fehlerhaft

# ERROR_KEEPASSFILE_ELEMENT_MISSING
source: The XML file is missing the KeePassFile element
de: Datenbank-XML enthält keine KeePassFile-Elemente

# ERROR_KEY_DERIVATION_FAILED
source: Key derivation failed
de: Schlüsselherleitung fehlgeschlagen

# ERROR_META_ELEMENT_MISSING
source: Meta XML element is missing
de: Datenbank-XML enthält kein Meta-Element

# ERROR_NO_DATA
source: No data
de: Keine Daten

# ERROR_NO_KEY_DATA
source: The key file contains no data
de: Die Schlüsseldatei enthält keine Daten

# ERROR_PASSWORD_OR_KEYFILE_WRONG
source: The password and/or the keyfile is wrong
de: Falsches Passwort und/oder falsche Schlüsseldatei

# ERROR_ROOT_ELEMENT_MISSING
source: The XML file contains no Root node
de: Datenbank-XML enthält kein Root-Element

# ERROR_UNKNOWN_ERROR_CODE
source: An unknown error occured
de: Ein unbekannter Fehler ist aufgetreten

# ERROR_UNKNOWN_FILE_FORMAT
source: Unknown file format
de: Unbekanntes Dateiformat

# ERROR_UNSUPPORTED_CHIPHER
source: Unsupported cipher algorithm
de: Verschlüsselungsalgorithmus wird nicht unterstützt

# ERROR_UNSUPPORTED_CIPHER
source: Unsupported cipher
de: Verschlüsselungsalgorithmus wird nicht unterstützt

# ERROR_UNSUPPORTED_DATABASER_VERSION
source: The Database version is not supported
de: Datenbankformat wird nicht unterstützt

# ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM
source: Unsupported compression algorithm
de: Kompressionsalgorithmus wird nicht unterstützt

# ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM
source: Unsupported random stream type
de: Format des Zufallsdatenstroms wird nicht unterstützt

# ERROR_UNSUPPORTED_KEYDERIVATION
source: Unsupported key derivation
de: Schlüsselherleitungsalgorithmus wird nicht unterstützt

# ERROR_WINDOW_TITLE_VALIDATION_FAILED
source: The Format of the Window Title is not valid!
de: Format des Fenstertitles ist fehlerhaft!

# ERROR_XML_KEYFILE_DATA_PARSING_ERROR
source: Unable to read the data of the XML keyfile
de: Daten des Schlüssels nicht lesbar

# ERROR_XML_KEYFILE_UNSUPPORTED_VERSION
source: Unsupported XML key file version
de: Schlüssel-XML-Datei Version wird nicht unterstützt

# ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT
source: The XML keyfile is missing the data element
de: Schlüssel-XML-Datei enhält kein Data-Element

# ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT
source: The XML keyfile is missing the key element
de: Schlüssel-XML-Datei enhält kein Key-Element

# ERRROR_XML_STRUCUTRE_MALFORMED
source: Malformed XML structure
de: Datenbank-XML Struktur ist fehlerhaft

source: Failed to allocate memory
de: Konnte keinen Speicher belegen

source: Function not implemented for the current algorithm
de: Funktion ist im aktuellen Algorithmus nicht implementiert

source: General
de: Allgemein

source: Illegal parameter supplied to encryption/decryption algorithm
de: Falscher Parameter wurde für Ver-/Entschlüsselung übergeben

source: Input data did not decode or decrypt correctly
de: Eingangsdaten konnten nicht dekodiert oder korrekt entschlüsselt werden

source: Input size to encryption algorithm was not aligned correctly
de: Eingabegröße für Verschlüsselung ist nicht korrekt auf Algorithmus ausgerichtet

source: Insufficient buffer provided for specified operation
de: Zu kleiner Puffer für Operation zur Verfügung

# KPK_ENTRY_COPY_%@
source: %@ copy
de: Kopie von %@

# KPK_GROUP_COPY_%@
source: %@ copy
de: Kopie von %@

source: Memory Failure
de: Speicherfehler

source: Network
de: Netzwerk

source: Parameter Error
de: Parameterfehler

source: Protect %@
de: %@ schützen

source: Set Background Color
de: Hintergrundfarbe festlegen

# SET_CUSTOM_ATTTRIBUTE_%@
source: Set Custom Attribute %@
de: Benutzerdefinierten Wert %@ festlegen

source: Set Foreground Color
de: Vordergrundfarbe festlegen

source: Set Notes
de: Notizen festlegen

source: Set Password
de: Passwort festlegen

source: Set Tags
de: Tags festlegen

source: Set Title
de: Titel festlegen

source: Set URL
de: URL festlegen

source: Set Username
de: Benutzername festlegen

source: Success
de: Erfolgreich

source: Trash
de: Papierkorb

source: Unimplemented Function
de: Funktion nicht implementiert

source: Unknown Error
de: Unbekannter Fehler

source: Unprotect %@
de: %@ nicht schützen
